Returns an enumerator that iterates through a collection.
  Namespace:   Autodesk.Revit.DB.Mechanical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
internal virtual IEnumerator GetBasicIEnumerator()
  Visual Basic
Friend Overridable Function GetBasicIEnumerator As IEnumerator
  Visual C++
internal:
virtual IEnumerator^ GetBasicIEnumerator()
 Return Value
 An IEnumerator object that can be used to iterate through the collection.
 Implements
  IEnumerable GetEnumerator
 See Also
  DuctSizeSettings Class
  Autodesk.Revit.DB.Mechanical Namespace